Revit 2026 API

# CurveComputeClosestPoints Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void ComputeClosestPoints(
	Curve otherCurve,
	bool withinThisCurveBounds,
	bool withinOtherCurveBounds,
	bool returnAllCriticalPnts,
	out IList<ClosestPointsPairBetweenTwoCurves> resultList
)
```
```vb
Public Sub ComputeClosestPoints (
	otherCurve As Curve,
	withinThisCurveBounds As Boolean,
	withinOtherCurveBounds As Boolean,
	returnAllCriticalPnts As Boolean,
	<OutAttribute> ByRef resultList As IList(Of ClosestPointsPairBetweenTwoCurves)
)
```
```cpp
public:
void ComputeClosestPoints(
	Curve^ otherCurve,
	bool withinThisCurveBounds,
	bool withinOtherCurveBounds,
	bool returnAllCriticalPnts,
	[OutAttribute] IList<ClosestPointsPairBetweenTwoCurves^>^% resultList
)
```
```fsharp
member ComputeClosestPoints :
        otherCurve : Curve *
        withinThisCurveBounds : bool *
        withinOtherCurveBounds : bool *
        returnAllCriticalPnts : bool *
        resultList : IList<ClosestPointsPairBetweenTwoCurves> byref -> unit
```

#### Parameters

otherCurve Curve

withinThisCurveBounds Boolean

withinOtherCurveBounds Boolean

returnAllCriticalPnts Boolean

resultList IListClosestPointsPairBetweenTwoCurves

#### Reference

Curve Class

Autodesk.Revit.DB Namespace